Рабочая.Задачи2/src/InformationRegisters/ЦБР_СоответствиеКуратораТипуЗадач/ЦБР_СоответствиеКуратораТипуЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦБР_СоответствиеКуратораТипуЗадач</name>
  <resources>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>РуководительЗадачи</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>Куратор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <dimensions>
    <name>ВидЗадачи</name>
    <type>
      <types>EnumRef.ЦБР_ВидЗадачи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Заказчик</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Рабочая.Задачи2/src/Catalogs/ЦБР_ГруппыСотрудников/ЦБР_ГруппыСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЦБР_ГруппыСотрудников</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Недействителен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Разработчик</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитик</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Рабочая.Задачи2/src/InformationRegisters/ЦБР_СоответствиеКуратораТипуЗадач/Forms/ФормаЗаписи/Module.bsl
&НаКлиенте
Процедура ПользователиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка) 
          
    СтандартнаяОбработка = Ложь;
    Оповещение = Новый ОписаниеОповещения("ОбработкаВыбораЗавершение", ЭтотОбъект);
       
    ПараметрыВыбора = Новый Структура;
    
    Если Элемент = Элементы.Исполнитель Тогда      
        Если ЗначениеЗаполнено(Запись.Куратор) Тогда
            ПараметрыВыбора.Вставить("УсловиеВыбора", "ВыборИсполнителяПоКуратору");
            ПараметрыВыбора.Вставить("Куратор", Запись.Куратор);  
            УсловиеВыбора = "ВыборИсполнителя";
        Иначе
            ПараметрыВыбора.Вставить("УсловиеВыбора", "ВыборИсполнителяБезКуратора");
            УсловиеВыбора = "ВыборИсполнителя"; 
        КонецЕсли;    
    ИначеЕсли Элемент = Элементы.Куратор Тогда   
        Запись.Исполнитель = ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка");
        ПараметрыВыбора.Вставить("УсловиеВыбора", "ВыборКуратора");
        УсловиеВыбора = "ВыборКуратора";
    ИначеЕсли Элемент = Элементы.РуководительЗадачи Тогда
        ПараметрыВыбора.Вставить("УсловиеВыбора", "ВыборРуководителя");
        УсловиеВыбора = "ВыборРуководителя"; 
    КонецЕсли;   
     
    ОткрытьФорму("РегистрСведений.ЦБР_СоответствиеКуратораТипуЗадач.Форма.ФормаВыбора", ПараметрыВыбора, ЭтотОбъект, , , , Оповещение, 
    РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
    

КонецПроцедуры
 
&НаКлиенте
Процедура ОбработкаВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт 

    Если Результат <> Неопределено Тогда
        Если УсловиеВыбора = "ВыборИсполнителя" Тогда
            Запись.Исполнитель = Результат;
            ЗаполнитьКуратораИРуководителя();      
        ИначеЕсли УсловиеВыбора = "ВыборКуратора" Тогда 
            Запись.Куратор = Результат;
        ИначеЕсли УсловиеВыбора = "ВыборРуководителя" Тогда
            Запись.РуководительЗадачи = Результат;    
        КонецЕсли;
    КонецЕсли;
     
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКуратораИРуководителя();   
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
        "ВЫБРАТЬ
        |   ЦБР_ГруппыСотрудниковСостав.Ссылка КАК Ссылка
        |ПОМЕСТИТЬ Группа
        |ИЗ
        |   Справочник.ЦБР_ГруппыСотрудников.Состав КАК ЦБР_ГруппыСотрудниковСостав
        |ГДЕ
        |   ЦБР_ГруппыСотрудниковСостав.Пользователь = &Пользователь
        |;
        |
        |////////////////////////////////////////////////////////////////////////////////
        |ВЫБРАТЬ
        |   ЦБР_ГруппыСотрудников.Руководитель КАК Руководитель
        |ИЗ
        |   Группа КАК Группа
        |       ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЦБР_ГруппыСотрудников КАК ЦБР_ГруппыСотрудников
        |       ПО Группа.Ссылка = ЦБР_ГруппыСотрудников.Ссылка";
    
    Запрос.УстановитьПараметр("Пользователь", Запись.Исполнитель);
    
    РезультатЗапроса = Запрос.Выполнить().Выгрузить(); 
    
    Если РезультатЗапроса.Количество() Тогда
        Запись.Куратор = РезультатЗапроса[0].Руководитель;
        Запись.РуководительЗадачи = РезультатЗапроса[0].Руководитель;
    КонецЕсли;   
    
    
КонецПроцедуры
